/*************************************************************************
	> File Name: 3.堆排序与线性建堆法.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Sun 28 Jan 2024 05:44:21 PM CST
 ************************************************************************/

/**
 * 堆排序
 * 先构建小顶堆，然后弹出n次
 * 堆排序在原数组上操作，没有多余得存储空间
 * 
 * 口诀：
 * 		1、将堆顶元素与堆尾元素交换
 * 		2、将此操作看做是堆顶元素弹出操作
 * 		3、按照头部弹出以后的策略调整堆
 * 
 * 普通建堆：向上调整
 * 线性建堆：向下调整，调整次数最少，速度最快
 * 
 * 线性建堆法复杂度推导：
 * 假设二叉树中有n个节点，最下面一层有n/2个节点，处理一次得节点有n/4，处理两次得节点有n/8
 * n/4*1 + n/8*2 + n/16*3 + ... + n/n*log2n
 * 
 * 树高为k
 * s = 2^(k-1)*1 + 2^(k-2)*2 + ... + 2^0*k
 * 2s = 2^k + 2^(k-1)*2 + 2(k-2)*3 + ... + 2^1*k
 * 2s-s = 2^k + 2^(k-1) + 2^(k-2) + ... + 2^1 - 2^0*k
 * s = 2^(k+1) - 2 - k
 * 2^(k+1) = n
 * 2和k为常熟将忽略掉，所以时间复杂度为O(n)
*/

#include<iostream>
using namespace std;

