/*************************************************************************
	> File Name: 2.模板-课程导学.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Fri 21 Mar 2025 12:23:57 AM CST
 ************************************************************************/

 /**
  * 模板基础：
  * 1.语法基础：模板函数
  * 2.趁热打铁：实现一个完美的add模板
  * 3.深入探索：模板的类型推导机制
  * 4.语法基础：模板类
  * 5.全特化与偏特化
  * 
  * 变参模板：
  * 1.语法基础：变参模板
  * 2.编码技巧：解析变参列表
  * 3.学以致用：实现function模板类
  * 
  * 模板元编程：初体验
  * 1.功能1: 判断偶数
  * 2.功能2: 累加求和
  * 3.功能3: 判断素数
  * 4.功能4: 素数累加求和
  * 
  * 项目实战
  * 1.复现STL：类型转换模板
  * 2.复现STL：vector模板类
  * 3.复现STL：map模板类
  * 4.特化实战：bool类型的vector
  * 5.灵机一动：统计函数执行次数
  * 6.综合实战：实现thread_pool线程池
  */

#include<iostream>
using namespace std;

