/*************************************************************************
	> File Name: 1.课程导学.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Wed 19 Jun 2024 11:42:36 PM CST
 ************************************************************************/

/**
 * 一、都会讲什么内容
 * 入门篇：一些疑问
 * 基础篇：封装、继承、多态、模板、异常处理
 * 高级篇：设计模式、STL源码、C++14，17，20标准解析，C++语法杂谈
 * 
 * 二、需要有什么基础，才能学
 * 1、熟练掌握C语言
 * 2、有一定的算法数据结构基础
 * 3、高中阶段的数理基础
 * 
 * 三、我真的可以学会么
 * 四、在哪里获取课程中的资料
*/

#include<iostream>
using namespace std;

