/*************************************************************************
	> File Name: 3.回答：C++为什么难学？.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Wed 19 Jun 2024 11:57:17 PM CST
 ************************************************************************/

/**
 * 一.为什么会有C++？
 * C的目的：为了方便的操作计算机
 * C++的目的：为了方便的解决实际编程问题
 * 
 * 二.实际编程问题的组成部分
 * 语言基础、编码能力、算法与数据结构、编程范式、设计模式
 * 
 * 三.其他难点
 * 1、C++的设计哲学问题：编译期报错
 * 2、C++的语言标准：C++98、C++11、C++14、C++17、C++20...
 */

#include<iostream>
using namespace std;

