/*************************************************************************
	> File Name: 1.封装-课程导学.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Tue 09 Jul 2024 11:47:01 PM CST
 ************************************************************************/

/**
 * 一、类的基本封装
 * 		1.初次相识：类与对象
 * 		2.编码安全：访问控制权限
 * 		3.生命周期：构造函数与析构函数
 * 		4.何以为我：属性和方法
 * 
 * 二、运算符重载
 * 		1.函数重载
 * 		2.类外运算符重载基础
 * 		3.类内运算符重载基础
 * 		4.函数对象、数组对象与指针对象
 * 		5.总结：运算符重载
 * 
 * 三、附加内容：返回值优化
 * 		1.RVO返回值优化
 * 		2.NRVO命名返回值优化
 * 		3.优化前后的效果对比
 */

#include<iostream>
using namespace std;

