/*************************************************************************
	> File Name: 3.重点：数据结构与算法的学习方法.cpp
	> Author: TaoJY
	> Mail: taojy@toramon.com
	> Created Time: Wed 15 Nov 2023 11:04:31 PM CST
 ************************************************************************/

/*
* 一、如何学习数据结构
* 数据结构 = 数据定义 + 结构操作
* 
* 链表是一种物理存储单元上非连续、非顺序的存储结构，数据元素的逻辑顺序是通过链表中的指针连接次序实现的。（结构定义）
* 链表通常支持的操作有，插入、删除、遍历查找等操作。（结构操作）
* 
* 数据结构就是定义一种性质，并且维护这种性质。
* 
* 学习，学细节
* 使用，用性质
* 
* 
* 二、如何学习算法
* 学习，学流程，及正确性
* 使用，用输出
* 
* 
* 三、如何确定程序中的BUG
* 先沿着“算法逻辑”，检查数据处理流程是否有问题。
* 再检查程序中每个阶段的“数据”是否符合预期。
*/

#include<iostream>
using namespace std;

